import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression

model = LinearRegression() #LinearRegression을 위한 모델 생성


#데이터 삽입
year = [[1880],[1890], [1900],[1905], [1910],[1915],[1920],
		[1925],[1930],[1935],[1940],[1945],[1950],[1955],
		[1960],[1962],[1964],[1966],[1968],[1970],[1972],
		[1974],[1976],[1978],[1980],[1982],[1984]]

mbbl = [[3.40119738166216], [4.34380542185368], [5.00394630594546],
		[5.37063802812766], [5.79301360838414],[6.06842558824411],
		[6.53524127101366],[6.97447891102505],[7.25276241805319],
		[7.41155628781116],[7.67322312112171],[7.86134179559999],
		[8.24354550792826],[8.6351539890498],[8.9455932708069],
		[9.09178203585205],[9.24086957701101],[9.39399437400392],
		[9.55421372407771],[9.72256501665588],[9.83005627445024],
		[9.92275081871697],[9.91284364746015],[9.99524597777567],
		[9.98654110767141],[9.87318297227127],[9.88369292520795]]


model.fit(X =year, y = mbbl)

lr = LinearRegression().fit(year, mbbl)



#그래프 그리기
plt.title('Oil Production')
plt.xlabel('year')
plt.ylabel('MBBL')
plt.plot(year, mbbl, 'k.')
plt.axis([1870,1990, 3,12])
plt.grid(True)
plt.plot(year, model.predict(year), color='r')

plt.show()

#예측 선의 기울기, y절편 구하기
print("lr.coef_: {}".format(lr.coef_))
print("lr.intercept_: {}".format(lr.intercept_))